Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.DimensionExaggerationAttributes.ExaggerationEnabled Property
 Exaggeration is enabled if the value is true.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool ExaggerationEnabled { get; set; }
Public Property ExaggerationEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DimensionSetBaseAttributes.DimensionExaggerationAttributes Class
Tekla.Structures.Drawing Namespace